import sys

# 1. Մենք ստեղծում ենք մի ցուցակ։ Մի տեղ հիշողության մեջ ստեղծվում է [10, 20] օբյեկտը։
#    x անունը սկսում է մատնացույց անել դրա վրա։
#    Հաշվիչը դառնում է 1։
x = [10, 20]
print(f"x ստեղծելուց հետո հաշվիչը՝ {sys.getrefcount(x)}")

# 2. Մենք ստեղծում ենք նոր y անուն և ասում, որ այն նույնպես մատնացույց անի նույն օբյեկտի վրա։
#    ԿԱՐԵՎՈՐ: Ցուցակի կրկնօրինակ չի ստեղծվում։ x-ը և y-ը ուղղակի երկու տարբեր անուն են նույն բանի համար։
#    Հաշվիչը դառնում է 2։
y = x
print(f"y = x-ից հետո հաշվիչը՝ {sys.getrefcount(x)}")

# 3. Մենք ջնջում ենք x անունը։ x-ն այլևս չի մատնանշում այդ օբյեկտը։
#    Հաշվիչը իջնում է 1-ով և դառնում է 1։ Օբյեկտը դեռ ողջ է, քանի որ y-ը դեռ նայում է նրան։
del x
print(f"del x-ից հետո հաշվիչը՝ {sys.getrefcount(y)}")

# 4. Հիմա ջնջում ենք նաև y-ը։
del y
# ԱՅՍ ՊԱՀԻՆ: Հաշվիչը դառնում է 0։
# «Շարքային ոստիկանը» տեսնում է, որ հաշվիչը 0 է և ասում է.
# «Այս օբյեկտին այլևս ոչ ոք չի նայում։ Այն անպետք է»։
# Եվ միանգամից, ԱՆՄԻՋԱՊԵՍ, այն ջնջվում է հիշողությունից։
